tutorials/cases/case_line/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


defaultFieldValues
(
);

regions
(
    boxToCell
    {
        box (-0.001 -0.01 -0.01) (0.001 0.01 -0.008);
        fieldValues
        (
            volScalarFieldValue porosityF 0.4
            volScalarFieldValue porosityF0 0.4
            volScalarFieldValue T 305
        );
    }

    boxToCell
    {
        box (-0.001 -0.01 -0.01) (0.001 -0.008 0.01);
        fieldValues
        (
            volScalarFieldValue porosityF 0.4
            volScalarFieldValue porosityF0 0.4
            volScalarFieldValue T 305
        );
    }
);


/*

regions
(
    sphereToCell
    {
        centre (0 0 0);
        radius 0.0127;
        fieldValues
        (
            volScalarFieldValue porosityF 0.4 
            volScalarFieldValue porosityF0 0.4 
            volScalarFieldValue T   305
        );
    }
);
*/

// ************************************************************************* //
